app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      # binding.pry
      if !Artist.find_by_id(params[:artist_id])
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      else
        @songs = Artist.find(params[:artist_id]).songs
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if !Song.find_by_id(params[:id])